# BuiltInFailures.RegenFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures Class
BuiltInFailures Class Members See Also
---
Failures about RegenFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RegenFailures
```

Visual Basic
---
```text
Public NotInheritable Class RegenFailures
```

Visual C++
---
```text
public ref class RegenFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RegenFailures
# See Also
BuiltInFailures..::..RegenFailures Members
Autodesk.Revit.DB Namespace